-- phpMyAdmin SQL Dump
-- version 4.7.9
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 07, 2018 at 07:22 AM
-- Server version: 10.1.31-MariaDB
-- PHP Version: 7.2.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `wjps`
--

-- --------------------------------------------------------

--
-- Table structure for table `activity`
--

CREATE TABLE `activity` (
  `activityID` int(11) NOT NULL,
  `accessTimeDate` datetime NOT NULL,
  `urlAccessed` varchar(250) NOT NULL,
  `urlAccessedTimeDate` datetime NOT NULL,
  `website` varchar(250) NOT NULL,
  `accessOutTimeDate` datetime DEFAULT NULL,
  `userID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `activity`
--

INSERT INTO `activity` (`activityID`, `accessTimeDate`, `urlAccessed`, `urlAccessedTimeDate`, `website`, `accessOutTimeDate`, `userID`) VALUES
(54, '2018-05-11 22:53:44', '/home.php', '2018-05-11 22:56:45', 'imperial', '2018-05-11 23:54:20', 7),
(55, '2018-05-11 22:56:53', '/home.php', '2018-05-11 22:56:53', 'sheffield', '2018-05-11 23:54:20', 7),
(56, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:10:37', 'imperial', '2018-05-11 23:54:20', 7),
(57, '2018-05-11 22:56:53', '/home.php', '2018-05-11 23:11:07', 'sheffield', '2018-05-11 23:54:20', 7),
(58, '2018-05-11 22:56:53', '/home.php', '2018-05-11 23:11:17', 'sheffield', '2018-05-11 23:54:20', 7),
(59, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:11:19', 'imperial', '2018-05-11 23:54:20', 7),
(60, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:11:22', 'imperial', '2018-05-11 23:54:20', 7),
(61, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:12:02', 'imperial', '2018-05-11 23:54:20', 7),
(62, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:12:33', 'imperial', '2018-05-11 23:54:20', 7),
(63, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:13:07', 'imperial', '2018-05-11 23:54:20', 7),
(64, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:17:19', 'imperial', '2018-05-11 23:54:20', 7),
(65, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:17:50', 'imperial', '2018-05-11 23:54:20', 7),
(66, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:17:58', 'imperial', '2018-05-11 23:54:20', 7),
(67, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:18:33', 'imperial', '2018-05-11 23:54:20', 7),
(68, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:19:06', 'imperial', '2018-05-11 23:54:20', 7),
(69, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:20:03', 'imperial', '2018-05-11 23:54:20', 7),
(70, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:20:18', 'imperial', '2018-05-11 23:54:20', 7),
(71, '2018-05-11 22:56:53', '/home.php', '2018-05-11 23:21:18', 'sheffield', '2018-05-11 23:54:20', 7),
(72, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:21:20', 'imperial', '2018-05-11 23:54:20', 7),
(73, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:21:22', 'imperial', '2018-05-11 23:54:20', 7),
(74, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:23:17', 'imperial', '2018-05-11 23:54:20', 7),
(75, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:23:37', 'imperial', '2018-05-11 23:54:20', 7),
(76, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:37:16', 'imperial', '2018-05-11 23:54:20', 7),
(77, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:38:19', 'imperial', '2018-05-11 23:54:20', 7),
(78, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:38:21', 'imperial', '2018-05-11 23:54:20', 7),
(79, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:39:04', 'imperial', '2018-05-11 23:54:20', 7),
(80, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:40:07', 'imperial', '2018-05-11 23:54:20', 7),
(81, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:41:54', 'imperial', '2018-05-11 23:54:20', 7),
(82, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:42:09', 'imperial', '2018-05-11 23:54:20', 7),
(83, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:43:27', 'imperial', '2018-05-11 23:54:20', 7),
(84, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:43:57', 'imperial', '2018-05-11 23:54:20', 7),
(85, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:44:54', 'imperial', '2018-05-11 23:54:20', 7),
(86, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:45:44', 'imperial', '2018-05-11 23:54:20', 7),
(87, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:46:10', 'imperial', '2018-05-11 23:54:20', 7),
(88, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:46:29', 'imperial', '2018-05-11 23:54:20', 7),
(89, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:48:07', 'imperial', '2018-05-11 23:54:20', 7),
(90, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:52:27', 'imperial', '2018-05-11 23:54:20', 7),
(91, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:53:02', 'imperial', '2018-05-11 23:54:20', 7),
(92, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:53:34', 'imperial', '2018-05-11 23:54:20', 7),
(93, '2018-05-11 22:53:44', '/home.php', '2018-05-11 23:54:19', 'imperial', '2018-05-11 23:54:20', 7),
(94, '2018-05-11 23:57:48', '/home.php', '2018-05-11 23:57:48', 'imperial', '2018-05-11 23:57:48', 7),
(95, '2018-05-11 22:56:53', '/home.php', '2018-05-11 23:58:11', 'imperial', '2018-05-11 23:58:11', 7),
(96, '2018-05-12 00:11:38', '/home.php', '2018-05-12 00:11:53', 'imperial', '2018-05-12 00:11:59', 7),
(97, '2018-05-12 00:11:59', '/home.php', '2018-05-12 00:11:59', 'imperial', '2018-05-12 00:11:59', 7),
(98, '2018-05-12 00:11:38', '/home.php', '2018-05-12 00:12:06', 'imperial', '2018-05-12 00:12:53', 7),
(99, '2018-05-12 00:11:38', '/home.php', '2018-05-12 00:12:09', 'imperial', '2018-05-12 00:12:53', 7),
(100, '2018-05-12 00:14:44', '/home.php', '2018-05-12 00:14:44', 'imperial', '2018-05-12 00:18:06', 7),
(101, '2018-05-12 00:15:01', '/home.php', '2018-05-12 00:15:01', 'imperial', '2018-05-12 00:18:06', 7),
(102, '2018-05-12 00:14:44', '/home.php', '2018-05-12 00:15:21', 'imperial', '2018-05-12 00:18:06', 7),
(103, '2018-05-12 00:15:01', '/home.php', '2018-05-12 00:15:37', 'imperial', '2018-05-12 00:18:06', 7),
(104, '2018-05-12 00:15:01', '/home.php', '2018-05-12 00:16:33', 'sheffield', '2018-05-12 00:18:06', 7),
(105, '2018-05-12 00:14:44', '/home.php', '2018-05-12 00:16:39', 'imperial', '2018-05-12 00:18:06', 7),
(106, '2018-05-12 00:14:44', '/home.php', '2018-05-12 00:16:41', 'imperial', '2018-05-12 00:18:06', 7),
(107, '2018-05-12 00:15:01', '/home.php', '2018-05-12 00:17:08', 'sheffield', '2018-05-12 00:18:06', 7),
(108, '2018-05-12 00:14:44', '/home.php', '2018-05-12 00:17:12', 'imperial', '2018-05-12 00:18:06', 7),
(109, '2018-05-12 00:15:01', '/home.php', '2018-05-12 00:18:19', 'sheffield', '2018-05-12 00:18:48', 7),
(110, '2018-05-12 00:15:01', '/home.php', '2018-05-12 00:18:39', 'sheffield', '2018-05-12 00:18:48', 7),
(111, '2018-05-12 01:10:57', '/home.php', '2018-05-12 01:11:19', 'imperial', '2018-05-12 01:17:45', 7),
(112, '2018-05-12 01:10:57', '/home.php', '2018-05-12 01:12:59', 'imperial', '2018-05-12 01:17:45', 7),
(113, '2018-05-12 01:10:57', '/home.php', '2018-05-12 01:13:28', 'imperial', '2018-05-12 01:17:45', 7),
(114, '2018-05-12 01:13:39', '/home.php', '2018-05-12 01:13:39', 'sheffield', '2018-05-12 01:17:45', 7),
(115, '2018-05-12 01:10:57', '/home.php', '2018-05-12 01:14:58', 'imperial', '2018-05-12 01:17:45', 7),
(116, '2018-05-12 01:10:57', '/home.php', '2018-05-12 01:17:40', 'imperial', '2018-05-12 01:17:45', 7),
(117, '2018-05-12 01:10:57', '/home.php', '2018-05-12 01:17:43', 'imperial', '2018-05-12 01:17:45', 7),
(118, '2018-05-12 01:23:42', '/home.php', '2018-05-12 01:23:42', 'imperial', '2018-05-12 01:33:14', 7),
(119, '2018-05-12 01:23:42', '/home.php', '2018-05-12 01:25:16', 'imperial', '2018-05-12 01:33:14', 7),
(120, '2018-05-12 01:23:42', '/home.php', '2018-05-12 01:25:40', 'imperial', '2018-05-12 01:33:14', 7),
(121, '2018-05-12 01:23:42', '/home.php', '2018-05-12 01:28:54', 'imperial', '2018-05-12 01:33:14', 7),
(122, '2018-05-12 01:23:42', '/home.php', '2018-05-12 01:33:03', 'imperial', '2018-05-12 01:33:14', 7),
(123, '2018-05-12 01:33:10', '/home.php', '2018-05-12 01:33:10', 'sheffield', '2018-05-12 01:33:14', 7),
(124, '2018-05-12 01:35:38', '/home.php', '2018-05-12 01:35:38', 'imperial', '2018-05-12 01:36:32', 7),
(125, '2018-05-12 01:36:29', '/home.php', '2018-05-12 01:36:29', 'sheffield', '2018-05-12 01:36:32', 7),
(126, '2018-05-12 01:37:03', '/home.php', '2018-05-12 01:37:03', 'imperial', '2018-05-12 01:37:52', 7),
(127, '2018-05-12 01:37:11', '/home.php', '2018-05-12 01:37:11', 'sheffield', '2018-05-12 01:37:52', 7),
(128, '2018-05-12 01:47:44', '/home.php', '2018-05-12 01:47:44', 'imperial', '2018-05-12 01:48:24', 7),
(129, '2018-05-12 01:48:20', '/home.php', '2018-05-12 01:48:20', 'sheffield', '2018-05-12 01:48:24', 7),
(130, '2018-05-12 01:47:44', '/home.php', '2018-05-12 01:48:27', 'imperial', '2018-05-12 01:48:30', 7),
(131, '2018-05-12 02:01:19', '/home.php', '2018-05-12 02:01:19', 'imperial', '2018-05-12 02:04:51', 11),
(132, '2018-05-12 02:01:33', '/home.php', '2018-05-12 02:01:33', 'sheffield', '2018-05-12 02:04:51', 11),
(133, '2018-05-12 02:01:19', '/home.php', '2018-05-12 02:04:33', 'imperial', '2018-05-12 02:04:51', 11),
(134, '2018-05-12 02:01:19', '/home.php', '2018-05-12 02:05:00', 'imperial', '2018-05-12 02:05:03', 11),
(135, '2018-05-12 02:05:27', '/home.php', '2018-05-12 02:05:28', 'sheffield', '2018-05-13 00:21:54', 7),
(136, '2018-05-12 02:05:35', '/home.php', '2018-05-12 02:05:35', 'imperial', '2018-05-13 00:21:54', 7),
(137, '2018-05-13 00:21:37', '/home.php', '2018-05-13 00:21:37', 'sheffield', '2018-05-13 00:21:54', 7),
(138, '2018-05-13 00:21:46', '/home.php', '2018-05-13 00:21:46', 'imperial', '2018-05-13 00:21:54', 7),
(139, '2018-05-13 00:21:46', '/home.php', '2018-05-13 00:21:56', 'imperial', '2018-05-13 00:21:57', 7),
(140, '2018-05-13 00:55:24', '/home.php', '2018-05-13 00:55:24', 'sheffield', '2018-05-13 01:49:50', 12),
(141, '2018-05-13 00:55:24', '/home.php', '2018-05-13 00:55:44', 'sheffield', '2018-05-13 01:49:50', 12),
(142, '2018-05-13 00:55:24', '/home.php', '2018-05-13 00:55:47', 'sheffield', '2018-05-13 01:49:50', 12),
(143, '2018-05-13 00:55:24', '/home.php', '2018-05-13 01:49:12', 'sheffield', '2018-05-13 01:49:50', 12),
(144, '2018-05-13 00:55:24', '/home.php', '2018-05-13 01:49:14', 'sheffield', '2018-05-13 01:49:50', 12),
(145, '2018-05-13 00:55:24', '/home.php', '2018-05-13 01:49:15', 'sheffield', '2018-05-13 01:49:50', 12),
(146, '2018-05-13 00:55:24', '/home.php', '2018-05-13 01:49:21', 'sheffield', '2018-05-13 01:49:50', 12),
(147, '2018-05-13 00:55:24', '/home.php', '2018-05-13 01:49:47', 'sheffield', '2018-05-13 01:49:50', 12),
(148, '2018-05-13 01:50:44', '/home.php', '2018-05-13 01:50:44', 'sheffield', '2018-05-13 01:56:25', 7),
(149, '2018-05-13 01:51:11', '/home.php', '2018-05-13 01:51:11', 'imperial', '2018-05-13 01:56:25', 7),
(150, '2018-05-13 01:51:11', '/home.php', '2018-05-13 01:56:27', 'imperial', '2018-05-13 01:56:30', 7),
(151, '2018-05-13 01:57:06', '/home.php', '2018-05-13 01:57:06', 'sheffield', '2018-05-13 02:08:48', 11),
(152, '2018-05-13 01:57:31', '/home.php', '2018-05-13 01:57:31', 'imperial', '2018-05-13 02:08:48', 11),
(153, '2018-05-13 02:12:39', '/home.php', '2018-05-13 02:12:39', 'sheffield', '2018-05-14 08:07:46', 7),
(154, '2018-05-13 02:35:25', '/home.php', '2018-05-13 02:35:25', 'imperial', '2018-05-14 08:07:46', 7),
(155, '2018-05-13 02:12:39', '/home.php', '2018-05-13 04:33:44', 'sheffield', '2018-05-14 08:07:46', 7),
(156, '2018-05-13 02:35:25', '/home.php', '2018-05-13 04:43:03', 'imperial', '2018-05-14 08:07:46', 7),
(157, '2018-05-14 08:07:39', '/home.php', '2018-05-14 08:07:39', 'sheffield', '2018-05-14 08:07:46', 7),
(158, '2018-05-14 08:07:42', '/home.php', '2018-05-14 08:07:42', 'imperial', '2018-05-14 08:07:46', 7),
(159, '2018-05-14 12:26:58', '/home.php', '2018-05-14 12:26:58', 'imperial', '2018-05-14 12:27:00', 7),
(160, '2018-05-14 12:30:25', '/home.php', '2018-05-14 12:30:26', 'sheffield', '2018-05-14 12:31:55', 7),
(161, '2018-05-14 12:31:25', '/home.php', '2018-05-14 12:31:25', 'imperial', '2018-05-14 12:31:55', 7),
(162, '2018-05-14 12:31:25', '/home.php', '2018-05-14 12:32:02', 'imperial', '2018-05-14 12:32:04', 7);

-- --------------------------------------------------------

--
-- Table structure for table `login`
--

CREATE TABLE `login` (
  `loginID` int(11) NOT NULL,
  `loginResult` enum('success','fail') NOT NULL,
  `loginTime` datetime NOT NULL,
  `userID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `login`
--

INSERT INTO `login` (`loginID`, `loginResult`, `loginTime`, `userID`) VALUES
(16, 'fail', '2018-03-29 12:16:39', 7),
(17, 'fail', '2018-03-29 12:17:04', 7),
(18, 'fail', '2018-03-29 12:17:35', 7),
(19, 'fail', '2018-03-29 12:17:37', 7),
(21, 'success', '2018-03-30 16:57:57', 7),
(22, 'success', '2018-03-30 17:24:46', 7),
(23, 'fail', '2018-03-30 17:25:21', 7),
(24, 'success', '2018-03-30 17:25:42', 7),
(25, 'fail', '2018-03-30 17:28:17', 7),
(26, 'success', '2018-03-30 17:28:42', 7),
(27, 'fail', '2018-03-30 17:48:39', 7),
(28, 'success', '2018-03-30 17:56:54', 7),
(29, 'success', '2018-03-30 19:34:47', 7),
(30, 'fail', '2018-04-02 04:03:12', 7),
(31, 'fail', '2018-04-02 04:10:20', 7),
(32, 'fail', '2018-04-02 04:44:49', 9),
(33, 'fail', '2018-04-02 04:45:32', 9),
(34, 'success', '2018-04-02 04:45:52', 9),
(35, 'success', '2018-04-02 04:48:27', 7),
(36, 'success', '2018-04-02 07:41:15', 9),
(37, 'success', '2018-04-04 04:25:42', 9),
(38, 'fail', '2018-04-09 04:33:10', 7),
(39, 'success', '2018-04-09 04:33:42', 7),
(40, 'success', '2018-04-16 12:06:53', 7),
(41, 'success', '2018-04-16 14:04:42', 7),
(42, 'success', '2018-04-28 00:02:33', 7),
(43, 'success', '2018-04-28 02:51:43', 7),
(44, 'fail', '2018-05-04 02:24:18', 10),
(45, 'fail', '2018-05-04 02:25:10', 10),
(46, 'fail', '2018-05-04 02:26:17', 10),
(47, 'fail', '2018-05-04 02:26:52', 10),
(48, 'fail', '2018-05-04 02:26:54', 10),
(49, 'fail', '2018-05-04 02:26:54', 10),
(50, 'fail', '2018-05-05 01:55:19', 10),
(51, 'fail', '2018-05-05 01:57:52', 7),
(52, 'fail', '2018-05-05 02:02:34', 7),
(53, 'success', '2018-05-05 02:03:06', 7),
(54, 'success', '2018-05-11 21:17:23', 7),
(55, 'fail', '2018-05-12 01:38:54', 10),
(56, 'fail', '2018-05-12 01:58:53', 11),
(57, 'success', '2018-05-12 02:01:19', 11),
(58, 'success', '2018-05-13 00:21:37', 7),
(59, 'fail', '2018-05-13 00:54:01', 12),
(60, 'success', '2018-05-13 00:55:24', 12),
(61, 'success', '2018-05-14 08:07:39', 7);

-- --------------------------------------------------------

--
-- Table structure for table `secretcode`
--

CREATE TABLE `secretcode` (
  `secretCodeID` int(11) NOT NULL,
  `characterNo` int(11) NOT NULL,
  `hashedCharacter` varchar(64) NOT NULL,
  `salt` varchar(32) NOT NULL,
  `userID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `secretcode`
--

INSERT INTO `secretcode` (`secretCodeID`, `characterNo`, `hashedCharacter`, `salt`, `userID`) VALUES
(29, 1, '4b3c650d651a897feceeb16670dc8e8be32b3b471f728aa9f90d3ef5971a44ea', 'ÝÒÔdº|4¹‘Fë]-§Xz Ñ•.³ó¤\rÖ?}ÿ', 7),
(30, 2, '73317e8d02d49b6053b08981cd148d714152ee0a04018916cec69dd3de63d298', 'ï·,ž4P6š¹t{BõmfA3Å „ÙÊC¹¡Ü‹eþ›', 7),
(31, 3, '9790b21ec01c156b656d6be84e5d6f622a5c7fa9d88ebf54d9d434cc0a163163', 'ëÛ&tYj\0•e­z¾çô¥jUIQ\0zsu\ryµèŸ', 7),
(32, 4, 'adf958a7b37ca2bf6155ebc89efb36e36ea822eda36d4fd97003ab309f446594', '“†Á%ä3™/oð!‰!ö(×-HÆ&š¥ƒÑ', 7),
(33, 5, '7b0fba2599b41d4ee5245a08cc5c93113b5d59fb4fb8e60cdf4e06769948d90f', '†õ¤÷(Ëx»1vw-\"Ñcxy~C\"ä©î¡Úœ$¹_', 7),
(34, 6, '02ca158cfc43bbc93ff21fde5a9e73e0bdcf5cc4e3bf5752b395efa0441e6477', 'B^ÓW—ÊíÉÈ=)% ´&–Ø>_A¿øiÉ©4', 7),
(35, 7, '3055b8c5f68625bde7fa42d8181640534ad0550054690bb22a3b1334683841cd', '­âŒzBÃšÎcb¢eé\0_Ü*@º†Â-¶Ô÷ÓT', 7),
(36, 8, '0d828e756b55a6ca8e55b8129d8999240aa0e8959c7223175e3ea340c5b556ad', 'Å±9ñxNÜáVëHéÄˆG=ÍŽPî*Ç4ÒÂ', 7),
(46, 1, '72cc6a878238db3aec099ef606be46dfa627561f47af5db166dd27636850c233', 'ˆ_Ó.³\"…ŠžôVV“ø±G‚Æ©ö­”®màâ', 9),
(47, 2, '8d4951c8bb2454623bd73e51bd1b4d3354e62e28aa9fcf962dd47b2269311486', 'Ãá\"7~[ÿ‘¾ðI;ËèÛpÌñÄ R[\nØCöŽàÀN', 9),
(48, 3, '5be50c823e10ef2df3d4f06b179ad056528796d90b2b1186de1a0fc6c3db59ee', 'ÃåÎ‰	xs5:¥Î¥€V>Ù¨§“Q,¨‚ ˆÛ', 9),
(49, 4, 'cf7976368c099b1167a2f9d48adfd035b0665ab9cea21fd9c49c617944e5546f', 'PRfÌ¯\\±o\0ÍÅá!ipÕXøÄ¯¾DåI=^c@', 9),
(50, 5, 'a19eaa3e5015f121a144a6820dc125e48e3180225d7ff8405c4d05d3745275e6', 'BG¹ðÔtMÒX˜ñ0Å*ço’\0ßK3\Z.ÿ<«80', 9),
(51, 6, '7f89c1a920bd23bfc3e3fe71ca044cf9fed1ee4ad23229202f9368e4dd6e42a5', '˜¯œŒŽV¯ ’lSÔÂ>E×NàæN‹GäFL­ç—Ã3ön', 9),
(52, 7, '5e4d1f81eed49239f8dc0da7a5b5c4f0d2d78a0cf0ec0aa3912df0e83bd83ff4', '4\0E±f\'<{}ˆ\n¼¹ù	ËÜqØÇÔ©¯°\r$è', 9),
(53, 8, '12a54d90d916a25ccb2030147f0676495325f03d0d2bb89ce84f53acf2b3e0bb', 'žM(\r\nˆbmx‰UXj€~þ©Ußå.„¶Ùñ™Í’ã¾ñó', 9),
(54, 9, 'f0f521bce8ed9004eed89f0605b23da5f8416e07adbc8b4667f7356bdcdcc9fa', 'a„B}òö mlÄ[âvÊõ¢žG>e&I\ZDªÇÃ\'²', 9),
(55, 1, 'ee166325499acb82ac391146243e9308b0d3f4565449d8e0188596685911d2be', 'ý.O(mâÔéè!%Ð\'µ_Í²­¶žii‘ó!¹$Hè', 11),
(56, 2, '921fb701df3f1da1d0543ad522eb97c2261c2327411a0eecbbfdbb28ae012af8', 'aÍÇk¿ÙØrÙùG2}àX‰bßö(YJyøh¡', 11),
(57, 3, 'a84e20a32b1c736814e77cba33504d19afd16ac27383792d208c7027d981ae2b', 'r –\0ùÌÂ3XN‡Ø2t‚ÇI«w„|?c’K‡	oP', 11),
(58, 4, '7850fb71ae333e2a6498acb3c56bfb7c3f68e4d62e132b2cc66ca7252748a141', ' cVØÙÆiDºuñéÁx4×‘6P¤9Fr', 11),
(59, 5, 'c8ae078f52c96a3ca8416dc1ec6e6d7c84e3bd63ae81f2401a8a50f65f99d835', 'y jÆJ®ê›æADkJÀb	—:¸š\"íLóQ9]', 11),
(60, 6, 'd8f021f23936a529733242fd9269047959a6fb82399ada4e8eb80ec111836578', 'ê9	—+•]Ø©´ucî¤¯¿²rcB¡åÖÖ4', 11),
(61, 7, '41a10ffc83d713f11b1552b0bdbf74054faec6e48d07b4de37c97db45123888d', '¶eg4ïâE`ÁuµLÜáF¦£©®ìbk[ì¬™êX', 11),
(62, 8, 'a957dd20e3d6cca96053b1b2f644078eb13f3683f98fea27306a45c49181c72b', '´à¢RªW¬H/2ZÅ˜8OWÈg2± =SÞâã«F', 11),
(63, 9, '3a0c9a4ce7d0ba7be27ea209aef8e865d87383ae4d48497747668cf432127e0e', 'b¯ç½j\\÷ÙÑý!eBÎ0jÝI„ÚA9GƒPÚ¢', 11),
(64, 10, '5ceb37ceb6515917743759799e947d6e7a61ae8defe5e570abf759b6bc8cd567', '×ŽrÝD²l\nXø§Nèú\rp×òê©rÚº™«S', 11),
(65, 11, '83be1fd46e724bdc45d58c78f87126148495e82173e2ef5224db05eab255fb26', 'HÑìâ€‹;@pä®–3ž»ÁÌ4E•–55¤‰1o2k', 11),
(66, 12, '17c9b83ef13757fb0c0e16851f8f900bb454e422d47ae5ff5cfdec5616e33159', ']ï•Iß™—öív«wãJÛø¦HbÄ‘«jƒ;tÏ', 11),
(67, 13, '5f53cf0917abc7b35ab2c94aacd256e15bd54d9fe5b1f55cf9522ad646863ef3', 'ýÙ°0ªæéžPñÄ‘¥ÐIéŒëêÑñý¸‘ÎK\0–', 11),
(68, 14, '715acc4f1be84cfd7a36cb0d806fdacd98e14f40858ebcec93ee12b61dc18c22', 'ƒªØ6Œ&é=P¤XL9_`ØÚï¼Êd—Ž=W', 11),
(69, 1, '60fa5beb681794ebbaaf75c331449d176221e1500836c8bdae7ea56d6aa757be', '¯3ÌŒK“&¤‚°âæ¾þ&Ç&¤.S™œur|ŠÀ<¯', 12),
(70, 2, 'd6657a2690477fd4e1aaaa064d7de4f273b093bf7d1933d4ab36c7faab429b95', '2C—ÄkÆcTš6}\"†\n{Tæê3R0•:Ôéb ¸§£', 12),
(71, 3, 'dc1916af44871721f149306ec42606d4e3b677ed6638b10f0bd8b50570e122f7', '{ÂeŸb½”³ˆ}1ª²RLjYÑÚîœš6ÌJPh', 12),
(72, 4, '9701f33128ecab4ff40a030db3c77a7629f290b15d7d52273692d175e0db98f3', 'Ï\Zâó·ŽôõÕŒÑ\"ÇQîæõ¿á©¥úºò¦DxŠ’­', 12),
(73, 5, 'ebe9ba312aad7171d4ab9ddb3b4d3c57f4028dca9eb8ae8f0c8472764adbd29a', 'ýKZëÈ¢‘Ñ#Æà%ßÐ`/vþ)m­ÏdÜ¡·T{', 12),
(74, 6, '663e4a1aacf73e6194f34269e75e98640643098b20f6779f39c82842ea0321ba', 'å¤Ð:âh†–»È\n	³ËÂÁv3¢—¶Ü¼YJÀqÿ', 12),
(75, 7, '0f153ea7f16c3863b09eb317b281c1d5ca77f77e1426141c67e16888d1f2738c', '‹ä‚Ûúð¹«”\Z9s&:¾êjFW×Ë†–ÂÅ†™', 12),
(76, 8, '30438da1980c47191c7ea872b86ddfc6614f3bffdc1fc45e0336d72655dbb4af', 'šÖ›ÂMñÃ°¢0ký—«2ÌCØÇmÂ{%Ä„ÏòyI@', 12),
(77, 9, '70fe63b2ebf9d3ed8e4f94eb056b9e8615374fd400aaef352f9611e8520399d7', '3‹§¯)8ýÒ€àµ¯b›‡jVï™CáSfóÅ\n³', 12),
(78, 10, 'cb39ef52fb31110f30f41332e90ed754cad82657f0e5e97d1eaa73aec8801124', '±iÈ*c¬sW†êº¹÷ä¤ÅÌq\"¼¶·«e‘\0', 12),
(79, 11, '854a7da0133d0992fcb1f4041fb108e34c3887641d8b5809d5ba0efe1d2cf5e1', 'A½û`•ºw¤Mhµhm¡8“è{‘}ú{˜«ß>O8ÌÍ', 12),
(80, 12, '83000b6f0b3f1e8b4dd77124525f509a89134ccf6e1f9c00c740bd3bd108ec6c', 'Áytg¡¤ò5YµœØ§Ô¡½¨ŸøÜ‡ÚùÆ(ýhkþ', 12),
(81, 13, '62e1a7ea931c8cf0eddaa344c5f129509660971d3b2af45ba05dd01edcb18a1c', 'ÐB\ZªQ­øžWÄˆ²ÿ ûÑbc\Z¼÷Ç^˜ujÇç±', 12),
(82, 14, '5afa1f644fcafdecfc85fdc9f1f48df8284b6852ad41806a40014c2f61dd6ce0', 'gWÃþ‘´ó¼J›KzÚL\ro+Šä¿(\"ï™', 12),
(83, 15, 'b465ab84a5afa912ecdd2edb8e7a6785fa1a16d62007285f0b61eff78b42b0f5', 'µ©Ò.3NmDç‹”âB¨Û?°G7 ¯V†é¶', 12),
(84, 16, 'ecae8e9487eb8dfb1d5b1153018957bb8f1223c274070c9ad8c496599af36363', '°-=ÄùEpÇX´Þ£Íù…låÄJþúÜs ·^Û', 12),
(85, 17, '4dcb37e6396af83e08765f76c46a806c4b36166b98ca8a664a16d4dacb50fedc', 'vº…,g*ˆOO Rõ¢üQ½txÅµ/\n‰¬\'Ã*K«n', 12),
(86, 18, '93756a6f9311f85cc658032c537a6c2eebe0fc4a1a33c0c348380a4218b7e735', '‹×8¢õTU‡çJT-tœŽÿ;¾©Qáœ‚l÷¾¶', 12),
(87, 19, '8c32a98cefe2c02d7f3083f677a01c7e18ce66ba3fe36ff99f6bc5ebed094ba8', 'ù¯¾({‹ú„Œ•‘›~¢<¨©õ¥C]smÆk QZt', 12),
(88, 1, 'f308b91bf90b702202e2cde86e9a82f43e34f13490de5c7766c1556adf14a003', 'Äl\0œb³•zÓ’¯v¹pé±I¿ßÔðÚKöžÕ¿˜', 13),
(89, 2, '354daba710fad1341cfa911f2ccfafbdf67de162e5bacbfa6e1f551f1fff53b3', ')Ç¢ùñOÁ‡SeO¬r‹f~ŽJôÂ/[[Ä‘0K›', 13),
(90, 3, '729d2dcdc05fc89524e7de80217ff0b9e8530ce7b2034e6b444c2ec0fd94694e', 'ÂÍïÁtQ~¤?|mÿ´ÀßM½džììê%ûÅ>Î', 13),
(91, 4, '36e24ea1f803260a06bdbc2644c2ed8cd9e2810275db02f8b19ef8d152934744', '§ˆ‰Úcâ—Z£­ià§kÖN‡¶;mç1¹¤Q®¨Éx', 13),
(92, 5, '00532156e7b19a4d099936445c2d9ddbbf7e9bb5202a11e31c4aea6e3724d116', ']Oª¸˜];µÖ6i¤yí9@¨×·Þ•.%C\\\"›H€T', 13),
(93, 6, 'e3515b5bb922c68f49600c929c0d4bf02e63ce478387822e753e3d7b947c30d0', 'C¾f\\óÉ\\™¨å%Š3áµ°ß,Ïù¢Œ¼‡FÂÁ', 13),
(94, 7, '6446cb01dc3b1656ee215ff5adff9c63b4616f1d6e27a3ad700f9d4ac0f4d4d5', 'éIN~l8Ÿ×UOw? Þ4» Ûë­K\r|­(û3ˆÍ', 13),
(95, 8, 'd868e9741b0dd90713c729deca753752db84d7330408ecd5926d0a89034f9281', 'Ÿì3KäBÙ¿ÂgèuÚ™¹ ”ÝBÚ`´ó(åô8ÐL€', 13),
(96, 9, '1a63924d9770e3a98106a4f920bb7dd9132f5cb576a291e64d2e413f951c6f23', 'çÅqˆÖi“ýç]œé;e÷™‡\'ö]µ€¾(tK', 13),
(97, 10, '2ea9f55de346d4da62f6d7157d00d6365c3ecfb8b1cf087cc5c827db8b4eeedd', '«›Ö­öL»”û	 O5»Ë9øÙÓÛÌºÙ/Þ4\0ª‚•', 13),
(98, 11, 'c497a55d8d760d3f2d445ad8a18066915fa364a83e43258620116a968383fbbe', '¶Þöá+ÄŠ)QóUŽšDÊÑ¼QŒèmÃJÌ¶¿´FK,', 13);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `userID` int(11) NOT NULL,
  `auth0ID` varchar(30) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`userID`, `auth0ID`, `name`, `email`) VALUES
(7, '5a8c324fb4024d4087f8b0e7', 'Mohammed', 'mohammedjammeh@yahoo.com'),
(9, '5ac18f463f989a2f5bef3766', 'Awa Jammeh', 'awa@yahoo.com'),
(10, '5aeb5bd99208b8058a4a7f9d', 'Reece', 'reece@yahoo.com'),
(11, '5af62c24dc67155d2b5e781a', 'mariamaceessay', 'mariama@yahoo.com'),
(12, '5af76c2190ac0b1c2920bd71', 'Bob Marley', 'bob@yahoo.com'),
(13, '5af965d17a46584ef167c1ad', 'Mohammed', 'mohammed@yahoo.com');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activity`
--
ALTER TABLE `activity`
  ADD PRIMARY KEY (`activityID`),
  ADD KEY `userID` (`userID`);

--
-- Indexes for table `login`
--
ALTER TABLE `login`
  ADD PRIMARY KEY (`loginID`),
  ADD KEY `userID` (`userID`);

--
-- Indexes for table `secretcode`
--
ALTER TABLE `secretcode`
  ADD PRIMARY KEY (`secretCodeID`),
  ADD KEY `userID` (`userID`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`userID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activity`
--
ALTER TABLE `activity`
  MODIFY `activityID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=163;

--
-- AUTO_INCREMENT for table `login`
--
ALTER TABLE `login`
  MODIFY `loginID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `secretcode`
--
ALTER TABLE `secretcode`
  MODIFY `secretCodeID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=99;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `userID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `activity`
--
ALTER TABLE `activity`
  ADD CONSTRAINT `activity_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `user` (`userID`) ON UPDATE CASCADE;

--
-- Constraints for table `login`
--
ALTER TABLE `login`
  ADD CONSTRAINT `login_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `user` (`userID`) ON UPDATE CASCADE;

--
-- Constraints for table `secretcode`
--
ALTER TABLE `secretcode`
  ADD CONSTRAINT `secretcode_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `user` (`userID`) ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
